bottom filling tank/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    inlet
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          16;
        startFace       23200;
    }
    outlet
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          400;
        startFace       23216;
    }
    pipe
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          160;
        startFace       23616;
    }
    tank
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          1984;
        startFace       23776;
    }
)

// ************************************************************************* //
